Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/katafc/httpd/target_count_21/repeat_26/18.txt
2020/01/27 16:37:05 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8018/
2020/01/27 16:37:35 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 9996 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8018
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.005 seconds
Complete requests:      9996
Failed requests:        0
Total transferred:      2888844 bytes
HTML transferred:       449820 bytes
Requests per second:    333.14 [#/sec] (mean)
Time per request:       300.171 [ms] (mean)
Time per request:       3.002 [ms] (mean, across all concurrent requests)
Transfer rate:          94.02 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  19.9      1     255
Processing:     5  296 251.5    157    3162
Waiting:        2  283 234.8    151    3149
Total:          6  300 252.9    158    3306
Percentage of the requests served within a certain time (ms)
  50%    158
  66%    430
  75%    490
  80%    547
  90%    618
  95%    675
  98%    804
  99%    905
 100%   3306 (longest request)
2020/01/27 16:37:35 Matched stat line [Connect:        0    4  19.9      1     255 Connect 0 4 19.9 1 255]
2020/01/27 16:37:35 Matched stat line [Processing:     5  296 251.5    157    3162 Processing 5 296 251.5 157 3162]
2020/01/27 16:37:35 Matched stat line [Waiting:        2  283 234.8    151    3149 Waiting 2 283 234.8 151 3149]
2020/01/27 16:37:35 Matched stat line [Total:          6  300 252.9    158    3306 Total 6 300 252.9 158 3306]
2020/01/27 16:37:35 Matched percentline [  50%    158 50 158]
2020/01/27 16:37:35 Matched percentline [  66%    430 66 430]
2020/01/27 16:37:35 Matched percentline [  75%    490 75 490]
2020/01/27 16:37:35 Matched percentline [  80%    547 80 547]
2020/01/27 16:37:35 Matched percentline [  90%    618 90 618]
2020/01/27 16:37:35 Matched percentline [  95%    675 95 675]
2020/01/27 16:37:35 Matched percentline [  98%    804 98 804]
2020/01/27 16:37:35 Matched percentline [  99%    905 99 905]
2020/01/27 16:37:35 Matched percentline [ 100%   3306 100 3306]
{"connect":{"max":255,"mean":4,"median":1,"min":0,"stdDev":19.899999618530273},"percentiles":{"100":3306,"50":158,"66":430,"75":490,"80":547,"90":618,"95":675,"98":804,"99":905},"processing":{"max":3162,"mean":296,"median":157,"min":5,"stdDev":251.5},"total":{"max":3306,"mean":300,"median":158,"min":6,"stdDev":252.89999389648438},"waiting":{"max":3149,"mean":283,"median":151,"min":2,"stdDev":234.8000030517578}}